{
  "title": "TCET-NSS UNIT",
  "titleDescription": "Not me but You",
  "section1": {
    "title": "Who Are We",
    "description": "The TCET NSS UNIT, is recognized as an extracurricular activity aided  by the University of Mumbai and supported by the Department of Youth Affairs and Sports, Government of India, operates under the inspiring motto 'NOT ME BUT YOU' .The unit is dedicated to fostering the personality and overall development of its volunteers, emphasising the value of selfless service for the greater well-being of society. With 42 members in 2005, the TCET NSS UNIT has grown to 200 volunteers, with more than 1450 active volunteers.This expansion underscores the unit's enduring commitment to engaging more students in meaningful community service and instilling a spirit for a brighter future.",
    "redirect": "../about"
  },
  "section2": {
    "title": "What We Do",
    "description": "The TCET NSS Unit is a catalyst for positive change and joy through community service. Focused on education, conservation of environment, health, sustainability and society needs. Our impactful initiatives resonate within our campus and extend beyond fostering a sense of togetherness within the entire community. With the collective efforts of 200 volunteers, we collaborate with NGOs and governmental bodies to reach a growing number of beneficiaries. In essence, the TCET NSS Unit stands as a beacon of compassionate action, driven by the belief that through service, we can sow the seeds of joy and progress for a brighter tomorrow.",
    "redirect": "../projects"
  },
  "section3": {
    "title": "Our Objectives",
    "description": "The focus is on enhancing the quality of educated manpower through the cultivation of social responsibility. This entails elevating both material and moral aspects of society by preparing students for dedicated service to the nation. By immersing urban students in rural life, they gain first hand exposure to the community around their institution. The objective is to make the campus responsive to community needs, establishing a constructive link between technical education and the social and economic reconstruction of the country. This involvement contributes to national development and fosters a deeper understanding and appreciation of societal issues, encouraging active community participation."
  },
  "section4": {
    "title":"Our Domains"
  },
  "section5": {
    "title": "Our Feats",
    "description": "Achievements are not endpoints but rather signposts illuminating the standards we aim to uphold, reminding us of the ongoing journey toward our fullest potential. They inspire continual growth and the pursuit of excellence, guiding us forward on our path of self-discovery and fulfillment."
  },
  "section6": {
    "title": "Testimonials"
  },
  "section7": {
    "title": "Recent Projects"
  }
}
